---
type: RevisionSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# RevisionSettings

`Autodesk.Revit.DB.RevisionSettings` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetRevisionSettings | 2015 | `public static RevisionSettings GetRevisionSettings ( Document ccda )` |
| Method | IsAcceptableRevisionCloudSpacing | 2015 | `public bool IsAcceptableRevisionCloudSpacing ( double rawValue )` |
| Method | RoundRevisionCloudSpacing | 2015 | `public static double RoundRevisionCloudSpacing ( Document ccda , double rawValue )` |
| Property | Parameter | — | `` |
| Property | RevisionCloudSpacing | 2015 | `public double RevisionCloudSpacing { get ; set ; }` |
| Property | RevisionNumbering | 2015 | `public RevisionNumbering RevisionNumbering { get ; set ; }` |